# Problem 1

In [3]:
import pandas as pd

### 1. 统计每个班同学各科成绩平均分大于80分的人数和人数占比（先计算每个同学各科平均分，在计算占比）
### 1. Count the number of students in each class whose average score is larger than 80. Average score is the mean score of all subjects.

In [8]:
tb_student={'name': ['Joey','Ross','Jane'], 'id': ['2017C3301001','2017C3301002','2017C3301003'], 
            'class': ['2017C3301','2017C3301','2017C3301'], 'in_time' : [2017,2017,2017],
            'age' : [18,19,20], 'sex' : ['M','M','F'], 'major' :['computer','computer','computer']}
tb_student=pd.DataFrame(tb_student)
tb_score={"id":["2017C3301001","2017C3301001","2017C3301002","2017C3301002","2017C3301003","2017C3301003"],
    "course":["math","database","math","database","math","database"],
    "score":[76,78,85,90,80,85]}
tb_score=pd.DataFrame(tb_score)

In [9]:
tb_student

   name            id      class  in_time  age sex     major
0  Joey  2017C3301001  2017C3301     2017   18   M  computer
1  Ross  2017C3301002  2017C3301     2017   19   M  computer
2  Jane  2017C3301003  2017C3301     2017   20   F  computer

In [10]:
tb_score

             id    course  score
0  2017C3301001      math     76
1  2017C3301001  database     78
2  2017C3301002      math     85
3  2017C3301002  database     90
4  2017C3301003      math     80
5  2017C3301003  database     85

In [11]:
mean_score=tb_score.groupby(['id'],as_index=False)['score'].mean() 
student_with_mean_score=pd.merge(tb_student,mean_score,on='id')
student_with_mean_score[student_with_mean_score['score']>80].groupby('class').size()

class
2017C3301    2
dtype: int64

### 2. 统计出班级“2017C3301”同学中“数据库”成绩分布数据（平均分按照10分分段，例如：成绩(90-100)分的、10人）
### 2. Give the 'database' score distribution of students in class '2017C3301'

In [12]:
data_cut=pd.cut(tb_score['score'],[0, 60, 70, 80, 90, 100], labels= [u'unqualified',u'(60,70]', u'(70,80]', u'(80,90]', u'(90,100]' ])
distribution=data_cut.value_counts()
result=distribution.sort_index()
result

unqualified    0
(60,70]        0
(70,80]        3
(80,90]        3
(90,100]       0
Name: score, dtype: int64

# Problem 2

### 1. 在下表中，统计出每位同学的每门课程最近一次考试的成绩（如李三最近一次的语文考试成绩是75分）
### 1. Give the latest score of every courses of each student

In [14]:
student_score={'name':['joey','joey','joey','joey','joey'],'course':['math','math','math','geo','geo'],
               'score':[78,45,87,65,84],'time':['2020-04-03','2020-04-03',
                                              '2020-02-03','2020-01-03',
                                              '2020-06-03']}
student_score=pd.DataFrame(student_score)
student_score.sort_values(by=['name','course','time'],inplace=True)
student_score.groupby(['name','course']).tail(1) #最远的时间 ; the nearest
student_score.groupby(['name','course']).head(1) #最近的时间 ; the farest

   name course  score        time
3  joey    geo     65  2020-01-03
2  joey   math     87  2020-02-03